[
  
    {"name":"Shell","windResistance":2,"sideSpin":2,"power":4,"cost":"n/a","description":"Offered during the <a href=\"/tournaments/SummerMajor2018/\">Summer Major 2018</a> tournament, this little guy offers a pretty good punch off the tee with a good tailwind and still gives you a decent amount of wind resistance for your eagle chance, or in your case, a bunker shot to save par.\n","needleSpeed":0.75},
  
    {"name":"Golden","windResistance":0,"sideSpin":2,"power":1,"cost":"n/a","description":"This is the ball you'll be forced to use during the Golden shot mini-game that pops up every few weeks. And it will become your favorite excuse when your shot stops 0.01 yards short of the outside ring.\n","needleSpeed":0.7},
  
    {"name":"Patriot","windResistance":3,"sideSpin":1,"power":3,"cost":"n/a","description":"This was part a cash package during the <a href=\"/tournaments/4thOfJuly/\">4th of July</a> tournament. It's identical to the Labor Day ball, which is enough to say it's a really good ball if you have it, and more than enough of an advantage for your opponent to put you down.\n","needleSpeed":0.833},
  
    {"name":"Season 2","windResistance":4,"sideSpin":1,"power":3,"cost":"n/a","description":"This ball was featured during the <a href=\"/tournaments/Mountain/\">Mountain</a> tournament. This is a solid ball for tournament Par 3's and you want to stretch your wood to reach from those second or third tees where the Power 3 can be handy. It's also a good option for holes with a stiff headwind. Now go out there and get that par!\n","needleSpeed":0.833},
  
    {"name":"Turbo","windResistance":0,"sideSpin":2,"power":5,"cost":"n/a","description":"This is the next best thing to a Snow Globe, just lacking that extra side spin. They were offered for purchase during the <a href=\"/tournaments/VegasSundown/\">Vegas Sundown</a> tournament. Obviously suited for tailwind situations, save these balls for tournaments even if you can't save yourself out of the sand.\n","needleSpeed":0.615},
  
    {"name":"Berserker","windResistance":1,"sideSpin":2,"power":5,"cost":"n/a","description":"This beast is tailor made for long par 4's and 5's with a tail wind. It can absolutely turn birdies into easy eagles, and eagles into chip in albotrosses. Unfortunately, you'll only find them in large quantities as prizes in Masters tournaments or part of expensive Black Friday cash offers. On the bright side, they show up as prizes in the Golden shot from time to time.\n","needleSpeed":0.833},
  
    {"name":"Mummy","windResistance":4,"sideSpin":1,"power":3,"cost":"n/a","description":"A really great ball that is perfect for head wind situations. It was awarded at the Rookie level during the <a href=\"/tournaments/CreepyCliffs/\">Creepy Cliffs</a> tournament and part of a cash package around the same time. Good for just about any situation, but you won't be able to take advantage of any tail wind, just like you couldn't take advantage of the sliced drive your opponent hit last game.\n","needleSpeed":0.75},
  
    {"name":"Basketball","windResistance":2,"sideSpin":2,"power":4,"cost":"n/a","description":"This one sports the same stats as the Shell ball (with a slower OP needle speed) so it's a slightly better Titan best used for downwind shots where you push your drive up towards the green. And like a basketball, you can watch it bounce off the rim of the cup for yet another disappointing tournament finish.\n","needleSpeed":0.833},
  
    {"name":"Quasar","windResistance":1,"sideSpin":2,"power":1,"cost":6.7,"description":"This is a ball that you can fund with your daily flow of gems from your chests once you get to the Tour 7 area. It's a similar ball to the Navigator and is usually the other option you can use on those early Pro Series tours depending on what the wind is doing. If you've got tail wind and it's a long hole, Quasar is often a better choice than the Navigator. It just swaps wind resistance for side spin. Now swap out your sloth-like reflexes and you'll be all set!\n","needleSpeed":0.75},
  
    {"name":"Ghost","windResistance":0,"sideSpin":2,"power":5,"cost":"n/a","description":"This ball was available for purchase during the <a href=\"/tournaments/PlatinumResorts/\">Platinum Resorts</a> tournament. It's a tailwind only ball so save them up for those situations where you can green it from the tee or at least get close. Watch it disappear over the horizon just like any chance you have at medaling in the upcoming tournament.\n","needleSpeed":0.75},
  
    [{"title":"Zachary Jones Ball Guide","url":"https://youtu.be/Eeeg5544afs"},{"title":"Golf Clash Tommy Ball Guide","url":"https://youtu.be/rpmNuIriqbk"}],
  
    {"name":"Touchdown","windResistance":1,"sideSpin":3,"power":3,"cost":"n/a","description":"These were part of a cash package around September of 2017 as well as the Touchdown tournament in early 2018. It's built for tailwind situations when you don't have a Berserker to spare. If you still have one, save it for tournaments so you can miss the weekend round by 1 stroke instead of 2.\n","needleSpeed":0.75},
  
    {"name":"Roulette","windResistance":2,"sideSpin":3,"power":4,"cost":"n/a","description":"The Roulette ball has the exact same stats as the Snowman Ball. They were offered for purchase during the <a href=\"/tournaments/VegasSundown/\">Vegas Sundown</a> tournament. They can be handy in tailwind situations when you need a little boost to reach a distant fairway but still want some decent wind resistance for your second shot. With your short game though, don't expect these to change your luck for the hole out.\n","needleSpeed":0.7},
  
    {"name":"Pumpkin","windResistance":3,"sideSpin":3,"power":3,"cost":"n/a","description":"This is a reskinned King Maker which makes it a really good ball for pretty much any situation. It was awarded to Pro, Expert and Masters top finishers in the <a href=\"/tournaments/HauntedHills/\">Haunted Hills</a> tournament. When your opponent breaks one out, it's just another reminder of how much better they did in that tournament than you.\n","needleSpeed":0.833},
  
    {"name":"Season 1","windResistance":3,"sideSpin":1,"power":4,"cost":"n/a","description":"This ball was featured during the <a href=\"/tournaments/MetroOpen/\">Metro Open</a> tournament. Only lacking in side spin, this ball can be used in virtually any situation very effectively. By your opponent....not you.\n","needleSpeed":0.833},
  
    {"name":"Snow Globe","windResistance":0,"sideSpin":3,"power":5,"cost":"n/a","description":"Reminiscent of a runaway train, it's a similar animal as the Berserker, minus the wind resistance, because wind resistance is for suckers. This will most definitely set some new long drive records, but I'm getting popcorn for the show coming in your ensuing shootout when you get stuck with a 25 MPH side wind.\n","needleSpeed":0.867},
  
    {"name":"Hat Trick","windResistance":4,"sideSpin":2,"power":2,"cost":"n/a","description":"During the <a href=\"/tournaments/FootballFever/\">Football Fever</a> tournament, these were offered as part of a cash package. They are a decent choice for a tournament Par 3 with the added wind resistance and a slight boost in power. And it also has a fitting name to describe the 3 putt you somehow managed to pull off against all odds!\n","needleSpeed":0.75},
  
    {"name":"Prestige","windResistance":1,"sideSpin":3,"power":4,"cost":"n/a","description":"This (worldwide) ball was available for purchase during the <a href=\"/tournaments/PlatinumResorts/\">Platinum Resorts</a> tournament. Same stats as the Origin Ball, but a slower needle speed on full overpowered shots makes this one a slightly better option for downwind tee shots if you're low on Berserkers. It'll make those long seconds shots you buried in the sand a little more managable too.\n","needleSpeed":0.833},
  
    {"name":"Pot O Gold","windResistance":3,"sideSpin":3,"power":2,"cost":"n/a","description":"This is pretty much a dressed up Katana with a bump in wind resistance. While this may not make it into the hall of fame it does make it a good ball for higher tour play, and it will definitely bring enough luck for your opponent to put their shot inside of yours on the shootout and make you run for that 3 stake special.\n","needleSpeed":0.833},
  
    {"name":"Santa","windResistance":5,"sideSpin":3,"power":0,"cost":"n/a","description":"Just your run of the mill, maxed out wind resistance ball that was awarded to top Rookie finishers during the <a href=\"/tournaments/Christmas/\">Christmas</a> tournament, and showed up as a prize for the Golden Shot around that time. Aside from the wind resistance, not a lot to get excited about...kind of like your short game.\n","needleSpeed":0.75},
  
    {"name":"Oceania","windResistance":5,"sideSpin":3,"power":0,"cost":"n/a","description":"This ball was featured during the <a href=\"/tournaments/ClubOceania/\">Club Oceania</a> tournament. It's a fantastic ball when it comes to tournament Par 3's. Tons of wind resistance and all the side spin you need to work the ball in towards the pin. The only excuse you have for not making the HIO now, is you.\n","needleSpeed":0.833},
  
    {"name":"Harvest","windResistance":2,"sideSpin":3,"power":3,"cost":"n/a","description":"The Harvest ball is an exact duplicate of the Country ball. So while it's a decent ball, there are many situations where you'll have better options. The design is very well done, just don't expect to harvest too many albatrosses with Sniper that can only seem to land great balls.\n","needleSpeed":0.833},
  
    {"name":"Country","windResistance":2,"sideSpin":3,"power":3,"cost":"n/a","description":"There were 17 of these gems offered right around the <a href=\"/tournaments/FootballFever/\">Football Fever</a> tournament. While they are really good balls, they may be a bit expensive (500 gems per pack) for what they really are. But if you have them, they combine the best attributes of the Katana and Titan. Hopefully your country was available so you can let your opponent know which country has the worst Golf Clash players!\n","needleSpeed":0.833},
  
    {"name":"Navigator","windResistance":2,"sideSpin":1,"power":1,"cost":6.7,"description":"This is an affordable ball and a workhorse that you should ride through tours 7, 8 and 9 since you can finance them with the gems you get in chests. It's got enough wind resistance to make the wind in those tours manageable and the small power boost will come in handy on many holes. You'll often want to switch between Navigator and Quasar depending on the wind but both are good choices...unlike your decision to overpower that drive and let it sail right into the heavy stuff.\n","needleSpeed":0.75},
  
    {"name":"Autumn","windResistance":2,"sideSpin":1,"power":5,"cost":"n/a","description":"The Autumn ball is geared towards downwind tournament shots where you'll still need to pull off a 2nd shot that will benefit from the extra wind resistance you'll get over using a Berserker. These were first offered during the <a href=\"/tournaments/FallMajor2018/\">Fall Major (2018)</a> tournament.\n","needleSpeed":0.75},
  
    {"name":"Labor Day","windResistance":3,"sideSpin":1,"power":3,"cost":"n/a","description":"This was part of a cash package offer during the <a href=\"/tournaments/LaborDay/\">Labor Day</a> tournament. It's a very capable ball that excels in head winds and also excels at judging your 'Great' chip as it lips out of the cup.\n","needleSpeed":0.833},
  
    {"name":"Jewel","windResistance":4,"sideSpin":0,"power":4,"cost":"n/a","description":"You would've found this one during the <a href=\"/tournaments/DesertOpen/\">Desert Open</a> tournament. It's got a great wind resistance / power combination but the lack of side spin is a serious limitation on this one so be prepared to use some curl. But it may be enough to tip the scales in your favor in a stiff headwind. Actually who are we kidding, you'll still find a way to mess it up!\n","needleSpeed":0.833},
  
    {"name":"Titan","windResistance":2,"sideSpin":2,"power":3,"cost":20,"description":"This is a great ball to have in large quantity for higher tours (think 9, 10, 11) and tournaments when every shot counts. They're often awarded to top Rookie finishers in tournaments. The extra power makes a lot of challenging holes from the back tees much easier to handle and while they're expensive, you can occasionally get some in the shop if you manage your gems. In a perfect world, you'll load up on these from your first few Rookie tournaments and ride them all way to rock bottom during your next full tilt clash session.\n","needleSpeed":0.833},
  
    {"name":"Blue Marble","windResistance":1,"sideSpin":3,"power":4,"cost":"n/a","description":"This ball was available during the <a href=\"/tournaments/EarthDay/\">Earth Day</a> tournament as part of a cash package. It's a bit of a nerfed Berserker but still useful in tailwaind situations. If you look closely, you can see some of the clouds moving on the ball. Do you see it? Good! Now you've wasted a good 5 seconds that you could've used to hit a quality golf shot.\n","needleSpeed":0.833},
  
    {"name":"Voyager","windResistance":4,"sideSpin":3,"power":1,"cost":"n/a","description":"This ball was featured during the <a href=\"/tournaments/Voyager/\">Voyager</a> tournament. It's a very solid option for tournament Par 3's and Par 4's where the extra wind resistance will be huge on your approach shot. The side spin shouldn't be overlooked either. Your failed attempt to drop your eagle pitch should be overlooked though.\n","needleSpeed":0.75},
  
    {"name":"Rival","windResistance":3,"sideSpin":3,"power":3,"cost":"n/a","description":"This reskinned King Maker commemorates yet another tragic collapse of the Americans on European soil. It's likely the European team were using these all around great balls to get a leg up on the Marlins sported by the American team. Rest assured, the U.S. will be bringing Royal balls in 2020.\n","needleSpeed":0.833},
  
    {"name":"Movie","windResistance":4,"sideSpin":3,"power":2,"cost":"n/a","description":"Part of a cash package during the <a href=\"/tournaments/Hollywood/\">Hollywood</a> tournament, this one is best used against some headwind or a decent option for a tournament par 3 if you're out of level 5 wind wind resistance balls. Lights...camera...FRINGE GLITCH!!\n","needleSpeed":0.867},
  
    {"name":"Easter","windResistance":2,"sideSpin":3,"power":2,"cost":"n/a","description":"This is a reskinned Katana so it's a pretty decent ball that you should probably save for situational holes where side spin is a must. Despite it's egg like appearance, it doesn't crack as easily as you do on the last hole of a tournament with a 15 foot putt to bring home the gold.\n","needleSpeed":0.833},
  
    {"name":"Bunny","windResistance":4,"sideSpin":1,"power":3,"cost":"n/a","description":"This ball was available during the <a href=\"/tournaments/EasterLinks/\">Easter Links</a> tournament as part of a cash package. It boasts the same stats as the Mummy ball so it's best used in a stiff headwind to get your moneys worth. Pull it out in the tournament on a par 3 and watch as it hops into the hole. Not the regulation hole, the shootout hole. Because you need a little more aggravation in your life.\n","needleSpeed":0.75},
  
    {"name":"Royal","windResistance":3,"sideSpin":2,"power":4,"cost":"n/a","description":"Long live the King! Playdemic decided to bring back the Dead Ball reincarnate and give you a fighting chance against the competition. Hopefully you stocked up on this one during the <a href=\"/tournaments/RoyalOpen/\">Royal Open</a> and dropped a little dough on the cash offer. If not don't worry, it probably wouldn't have done you much good anyway...\n","needleSpeed":0.833},
  
    {"name":"Basic","windResistance":0,"sideSpin":0,"power":0,"cost":0,"description":"If it's free, it's for me! This is the ball you should be using for <em>at least</em> the first 4 tours and ideally until Tour 7 unless you're really running into problems. With the basic ball, what you see is what you get, and that's not much but we love it because it's simple, reliable and always willing to be our friend in spite of how bad we played in the Christmas tournament.\n","needleSpeed":0.7},
  
    {"name":"King Maker","windResistance":3,"sideSpin":3,"power":3,"cost":72.2,"description":"One of the best balls in the game, and also the most expensive in terms of gems. Many tournaments will give them out in Pro, Expert and Masters (at least to those who finish close to the top) but you'll also get one every once in a while in a chest. They're way too expensive to use gems on in the shop though. You're best off stashing these until you hit the upper tours (10, 11) and higher level tournaments. Until then you can watch it spin in the shop while it taunts you about how you don't deserve it.\n","needleSpeed":0.867},
  
    {"name":"Bauble","windResistance":5,"sideSpin":1,"power":2,"cost":"n/a","description":"Another ball that works really well for Par 3's. It was part of a winter time cash package and also awarded during the <a href=\"/tournaments/WinterLinks/\">Winter Links</a> tournament. The key stat is obviously the wind resistance but the bump in power is nice for longer par 3's where you want to use a long iron instead of a wood. And most importantly, the animation looks awesome as it screams through the air and plugs into that greenside bunker.\n","needleSpeed":0.75},
  
    {"name":"Eye","windResistance":5,"sideSpin":2,"power":1,"cost":"n/a","description":"A ball from the <a href=\"/tournaments/HauntedHills/\">Haunted Hills</a> tournament with maxed wind resistance that you should primarily use on par 3's. Just a small bump of side spin means you'll need to use it with the right club since you won't be able to stretch a long iron into a hole built for a wood. And after you miss that wide open green with a Marlin come tournament time, I'll be waiting to tell you \"Eye told you so\".\n","needleSpeed":0.75},
  
    {"name":"King Maker X","windResistance":3,"sideSpin":3,"power":4,"cost":"n/a","description":"Finally a ball that may be able to stop your unintentional trophy dump in T10! This is unquestionably the best all around ball in the game so hopefully you stocked up while they were available in the shop during the <a href=\"/tournaments/FallMajor2018/\">Fall Major</a> tournament.\n","needleSpeed":0.867},
  
    {"name":"Origin","windResistance":1,"sideSpin":3,"power":4,"cost":"n/a","description":"Available during the <a href=\"/tournaments/OriginLinks/\">Origin Links</a> tournament, these leather bound beauties have the same stats as the Blue Marble ball. This makes it a good tailwind ball if you don't have the Berserker to spare or maybe don't need it. The epitome of 'Old School', they should suit your outdated and underperforming game just fine.\n","needleSpeed":0.7},
  
    {"name":"Striker","windResistance":3,"sideSpin":3,"power":3,"cost":"n/a","description":"This is nothing more than a skinner Kingmaker, which makes it nothing more than a great ball for virtually any situation. It was offered as part of a cash package during the <a href=\"/tournaments/VegasSundown/\">Vegas Sundown</a> tournament, and when you come up against one of these ball, my money is the other guy.\n","needleSpeed":0.75},
  
    {"name":"Snowman","windResistance":2,"sideSpin":3,"power":4,"cost":"n/a","description":"This was the Pro, Expert and Masters ball prize in the <a href=\"/tournaments/WinterLinks/\">Winter Links</a> tournament. It's got a simliar spirit as the Berserker but tamed down a bit which makes it perfect for people like yourself who can't control their drives. You'll ideally play this one on holes with the wind behind you.\n","needleSpeed":0.833},
  
    {"name":"Katana","windResistance":2,"sideSpin":3,"power":2,"cost":20,"description":"I used to be in the 'Titan is way better boat', but the value of the extra side spin you get with a Katana can't be understated. Once you get to the higher tours like 10 & 11, side spin is critical on certain shootouts and if your opponent has less, you'll have a definite advantage. If you're willing to spend money in the game, the 'Fail to Qualify' tournament offers give you a nice way to stock up on these. And who are we kidding, you always fail to qualify!\n","needleSpeed":0.833},
  
    {"name":"Dead","windResistance":3,"sideSpin":2,"power":4,"cost":"n/a","description":"Arguably the best general purpose ball in the game. It was awarded to Pro, Expert and Masters top finishers in the <a href=\"/tournaments/CreepyCliffs/\">Creepy Cliffs</a> tournament. It ticks all the right boxes and doesn't have any real weaknesses (except the lag on your phone that pushes it into the drink). Happy hunting with this bad boy.\n","needleSpeed":0.867},
  
    {"name":"Turkey","windResistance":5,"sideSpin":1,"power":2,"cost":"n/a","description":"Same stats as the Bauble, these were available in a cash package during the <a href=\"/tournaments/Thanksgiving/\">Thanksgiving</a> tournament. Another max wind resistance ball that are really handy to have in supply come tournament time. They can really ease the pain of that bogey you pulled out of your hat on the last par 5.\n","needleSpeed":0.7},
  
    {"name":"Spider","windResistance":4,"sideSpin":2,"power":1,"cost":"n/a","description":"This ball was available for purchase during the <a href=\"/tournaments/PlatinumResorts/\">Platinum Resorts</a> tournament. Although there are better options, the Spider ball is a decent choice to pull out for a tournament par 3, to help you get that HIO to turn your 98th place finish into 83rd.\n","needleSpeed":0.833},
  
    {"name":"Marlin","windResistance":1,"sideSpin":1,"power":0,"cost":2.8,"description":"This is a dirt cheap ball that you may want to break out in Tours 5 and 6 if you run into a vicious losing streak and need a leg up or if you're facing a stiff headwind that will make it impossible to reach the green in 2. The side spin it gives you can also be the difference on the Tour 6 Southern Pines shootouts when you're working with a driver that lacks curl (e.g. EM5). You'll typically see <a href=\"https://i.imgur.com/JNhU5Tt.gif\" target=\"_blank\" rel=\"noopener\">Oprah</a> shelling these things out in pin chests like they were cars.\n","needleSpeed":0.7},
  
    {"name":"Gear","windResistance":2,"sideSpin":1,"power":5,"cost":"n/a","description":"This ball was featured during the <a href=\"/tournaments/LaborDay2018/\">Labor Day (2018)</a> tournament. While you may not be able to pound this one down the fairway quite as far as a Globe or Berserker, it offers you a much easier 2nd shot with the extra wind resistance it offers. Wind resistance isn't really your biggest problem though is it, Mr. Great Ball?\n","needleSpeed":0.75},
  
    {"name":"Bandera","windResistance":5,"sideSpin":2,"power":1,"cost":"n/a","description":"This ball was available for purchase during the <a href=\"/tournaments/CincoDeMayo/\">Cinco de Mayo</a> tournament. Same stats as an Eye Ball, so pull this wind resistance ball out on Par 3s. It will absolutely give you a great chance at leaving the ball hanging on the rim of the cup.\n","needleSpeed":0.75}
  
]
